git-init.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>git-init</title>
<!-- 2015-02-04 Wed 10:41 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Toby Tripp" />
<link rel="stylesheet" href="https://maxcdn.bootstrapcdn.com/bootstrap/3.3.2/css/bootstrap.min.css">
<link rel="stylesheet" href="css/htmlize.css">
<link rel="stylesheet" href="css/config.css">
</head>
<body>
<div id="preamble" class="status">
<p><a accesskey="H" href="index.html">HOME</a></p>
</div>
<div id="content">
<h1 class="title">git-init</h1>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Git Source Control</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1">Git Executable Path</h3>
<div class="outline-text-3" id="text-1-1">
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #f5deb3;">(</span>setenv  <span style="color: #2aa198;">"PATH"</span> <span style="color: #b58900;">(</span>concat <span style="color: #268bd2;">(</span>getenv <span style="color: #2aa198;">"PATH"</span><span style="color: #268bd2;">)</span> <span style="color: #2aa198;">":"</span> <span style="color: #2aa198;">"/usr/local/bin"</span> <span style="color: #2aa198;">":"</span> <span style="color: #2aa198;">"/usr/local/git/bin/"</span><span style="color: #b58900;">)</span><span style="color: #f5deb3;">)</span>
<span style="color: #f5deb3;">(</span>setq exec-path <span style="color: #b58900;">(</span>append exec-path '<span style="color: #268bd2;">(</span><span style="color: #2aa198;">"/usr/local/bin"</span><span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span><span style="color: #f5deb3;">)</span>
<span style="color: #f5deb3;">(</span>setq exec-path <span style="color: #b58900;">(</span>append exec-path '<span style="color: #268bd2;">(</span><span style="color: #2aa198;">"/usr/local/git/bin"</span><span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span><span style="color: #f5deb3;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2">Magit</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Probably the very best git front-end out there.
</p>

<p>
I like it to open full-screen and then restore my windows where
they were when it is done:
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #f5deb3;">(</span>require-package 'magit<span style="color: #f5deb3;">)</span>
<span style="color: #f5deb3;">(</span><span style="color: #859900; font-weight: bold;">eval-after-load</span> <span style="color: #2aa198;">"magit"</span>
  '<span style="color: #b58900;">(</span><span style="color: #859900; font-weight: bold;">progn</span>
     <span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold;">defadvice</span> <span style="color: #268bd2;">magit-status</span> <span style="color: #dc322f;">(</span>around magit-fullscreen activate<span style="color: #dc322f;">)</span>
       <span style="color: #dc322f;">(</span>window-configuration-to-register <span style="color: #268bd2; font-style: italic;">:magit-fullscreen</span><span style="color: #dc322f;">)</span>
       ad-do-it
       <span style="color: #dc322f;">(</span>delete-other-windows<span style="color: #dc322f;">)</span><span style="color: #268bd2;">)</span>

     <span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold;">defun</span> <span style="color: #268bd2;">magit-quit-session</span> <span style="color: #dc322f;">()</span>
       <span style="color: #2aa198; font-style: italic;">"Restores the previous window configuration and kills the magit buffer"</span>
       <span style="color: #dc322f;">(</span>interactive<span style="color: #dc322f;">)</span>
       <span style="color: #dc322f;">(</span>kill-buffer<span style="color: #dc322f;">)</span>
       <span style="color: #dc322f;">(</span>jump-to-register <span style="color: #268bd2; font-style: italic;">:magit-fullscreen</span><span style="color: #dc322f;">)</span><span style="color: #268bd2;">)</span>

     <span style="color: #268bd2;">(</span>define-key magit-status-mode-map <span style="color: #dc322f;">(</span>kbd <span style="color: #2aa198;">"q"</span><span style="color: #dc322f;">)</span> 'magit-quit-session<span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span><span style="color: #f5deb3;">)</span>
</pre>
</div>

<p>
Quick one-button git status:
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #f5deb3;">(</span>global-set-key <span style="color: #b58900;">(</span>kbd <span style="color: #2aa198;">"&lt;f2&gt;"</span><span style="color: #b58900;">)</span> 'magit-status<span style="color: #f5deb3;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3">git-grep</h3>
<div class="outline-text-3" id="text-1-3">
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #f5deb3;">(</span><span style="color: #859900; font-weight: bold;">defun</span> <span style="color: #268bd2;">git-grep-rb</span> <span style="color: #b58900;">(</span>regexp<span style="color: #b58900;">)</span>
  <span style="color: #2aa198; font-style: italic;">"Run git-grep on ruby files in the current project"</span>
  <span style="color: #b58900;">(</span>interactive <span style="color: #2aa198;">"sSearch for (regexp): "</span><span style="color: #b58900;">)</span>
  <span style="color: #b58900;">(</span>vc-git-grep regexp <span style="color: #2aa198;">"'*.rb'"</span> <span style="color: #268bd2;">(</span>textmate-project-root<span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span><span style="color: #f5deb3;">)</span>

<span style="color: #f5deb3;">(</span><span style="color: #859900; font-weight: bold;">defun</span> <span style="color: #268bd2;">git-grep</span> <span style="color: #b58900;">(</span>regexp<span style="color: #b58900;">)</span>
  <span style="color: #2aa198; font-style: italic;">"Run git-grep on files in the current project"</span>
  <span style="color: #b58900;">(</span>interactive <span style="color: #2aa198;">"sSearch for (regexp): "</span><span style="color: #b58900;">)</span>
  <span style="color: #b58900;">(</span>vc-git-grep regexp <span style="color: #2aa198;">"'*.rb' '*.clj'"</span> <span style="color: #268bd2;">(</span>textmate-project-root<span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span><span style="color: #f5deb3;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-4" class="outline-3">
<h3 id="sec-1-4">vc-annotate</h3>
<div class="outline-text-3" id="text-1-4">
<p>
Built-in to Emacs and really useful.  It allows you to not only
view source control annotations, but also to move back and forward
in time within the file.  Very nice.
</p>

<p>
It's nicer, I think, when it ignores white-space:
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #f5deb3;">(</span><span style="color: #859900; font-weight: bold;">defun</span> <span style="color: #268bd2;">vc-git-annotate-command</span> <span style="color: #b58900;">(</span>file buf <span style="color: #b58900;">&amp;optional</span> rev<span style="color: #b58900;">)</span>
  <span style="color: #b58900;">(</span><span style="color: #859900; font-weight: bold;">let</span> <span style="color: #268bd2;">(</span><span style="color: #dc322f;">(</span>name <span style="color: #cb4b16;">(</span>file-relative-name file<span style="color: #cb4b16;">)</span><span style="color: #dc322f;">)</span><span style="color: #268bd2;">)</span>
    <span style="color: #268bd2;">(</span>vc-git-command buf 0 name <span style="color: #2aa198;">"blame"</span> <span style="color: #2aa198;">"-w"</span> rev<span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span><span style="color: #f5deb3;">)</span>
</pre>
</div>

<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #f5deb3;">(</span><span style="color: #859900; font-weight: bold;">provide</span> '<span style="color: #268bd2; font-weight: bold;">git-init</span><span style="color: #f5deb3;">)</span>
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Toby Tripp</p>
<p class="date">Created: 2015-02-04 Wed 10:41</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.3.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
